class WorkBook < Book
  MATH_BOOK_NAME = %w(
    青チャートI+A 青チャートⅡ＋B 青チャートC
    黄チャートI+A 黄チャートⅡ＋B 黄チャートC
    やさしい理系数学 ハイレベル理系数学
    理系数学の良問プラチカ1A2B 理系数学の良問プラチカ3 文系数学の良問プラチカ1A2B
    新数学スタンダード演習1A2B 新数学スタンダード演習3
  )
  ENG_BOOK_NAME = %w(
    やっておきたい英語長文300 やっておきたい英語長文500 やっておきたい英語長文700 やっておきたい英語長文1000
  )
  PHY_BOOK_NAME = %w(
    物理のエッセンス 良問の風 名門の森 物理重要問題集 難問題の系統とその解き方
  )
  CHE_BOOK_NAME = %w(
    らくらくマスター化学基礎・化学 化学基礎問題精講 化学標準問題精講 化学の新演習
  )
  GENDAI_BOOK_NAME = %w(
    現代文読解力の開発講座
  )
  KOBUN_BOOK_NAME = %w(
    古文入門 古文上達基礎編 古文上達 入試精選問題集古文 漢文道場 入試精選問題集漢文
  )
  WH_BOOK_NAME = %w(
    実力をつける世界史100題 
  )
  JH_BOOK_NAME = %w(
    実力をつける日本史100題
  )
  GEO_BOOK_NAME = %w(
    実力をつける地理100題
  )


end